package org.sourseit.Trockiy.homework.first;

/**
 * Created by CheZter on 15.06.2015.
 */
public class createClass {
    int i;
    char c;
    public static void main(String[] args) {
        createClass c1 = new createClass();
        System.out.println(c1.c);
        System.out.println(c1.i);
    }
}
//Создать класс, который содержит int и char
// (не проинициализированные) и распечатать их значения.